app/controllers/admin_controller.rb

SELECT * FROM `products` ORDER BY model
---
  def list_products
    @prds = Product.all(:order=>:model)

SELECT * FROM `products` WHERE (`products`.`id` = 836798121)
---
  def edit_product
		@title = "Editar producto"
    @prd = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 0)
UPDATE `products` SET `updated_at` = '2010-10-12 18:33:50', `preu` = '59.91' WHERE `id` = 836798121
---
	def update_product
		@prd = Product.find(params[:id])

		#if (params[:enabled]) &&  !(@prd.enabled)
		#	fileSrc = File.join(get_directory,"#{@prd.id}.jpg" )
		#	fileTrg = File.join(get_directory,"#{@prd.model}.jpg" )
		#	File.rename(fileSrc,fileTrg)
		#elsif !(params[:enabled]) &&  (@prd.enabled)
		#	fileTrg = File.join(get_directory,"#{@prd.id}.gz" )
		#	File.rename(fileSrc,fileTrg)
		#end

		respond_to do |format|
      if @prd.update_attributes(params[:prd])

SELECT * FROM `configurations` WHERE (`configurations`.`key` = 'banner') LIMIT 1
---
	def edit_banner
		@title = "Editar banner"
    @cfg = Configuration.find_by_key("banner")

SELECT * FROM `configurations` WHERE (`configurations`.`id` = 1)
UPDATE `configurations` SET `updated_at` = '2010-11-08 23:26:39', `value` = 'Zapatilla pintadas<br> a mano. Un regalo...<br>¿para ti o para quién?<br>' WHERE `id` = 1
---
	def update_banner
		@cfg = Configuration.find(params[:id])
		respond_to do |format|
      if @cfg.update_attributes(params[:cfg])

SELECT * FROM `buyers` ORDER BY created_at
---
  def list_buyers
    @buyers = Buyers.all(:order=>:created_at)

SELECT * FROM `buyers` WHERE (`buyers`.`id` = 65)
DELETE FROM `buyers` WHERE (`id` IN (65))
---
	def delete_buyer
		@buy = Buyers.find(params[:id])
		@buy.delete()

SELECT * FROM `contacts` ORDER BY created_at
---
	def list_contacts
    @contacts = Contact.all(:order=>:created_at)

INSERT INTO `promocodes` (`start_date`, `created_at`, `code`, `days`, `updated_at`, `value`, `end_date`, `state`) VALUES('2011-02-27', '2011-02-27 13:58:36', 'IYPXAXOO', 10, '2011-02-27 13:58:36', 100.0, '2011-03-09', NULL)
---
	def view_promocode
		@prc=Promocode.new(params[:promocode])
		if !@prc.valid?()
			render(:action=>:new_promocode)
		else
			@prc.end_date = @prc.start_date + @prc.days
			@prc.save()

SELECT * FROM `promocodes` WHERE (`promocodes`.`id` = 1)
DELETE FROM `promocodes` WHERE (`id` IN (1))
---
	def delete_promocode
		@prc = Promocode.find(params[:id])
		@prc.delete()

INSERT INTO `promocodes` (`start_date`, `created_at`, `code`, `days`, `updated_at`, `value`, `end_date`, `state`) VALUES('2011-03-02', '2011-03-02 22:36:42', 'GWXLOIXD', 29, '2011-03-02 22:36:42', 1.0, '2011-03-31', 1)
---
	def make_codes
		610.times do
			p=Promocode.new()
			p.code =  ""; 8.times{p.code  << (65 + rand(25)).chr}