app/controllers/cart_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products`

  def edit
    params[:edit] = true
    @param =params[:id]

    regEx =  params[:id].match(/(\d{3})([ABC])(\d{2})/)
    @model = regEx[1]
    @color =   regEx[2]
    @cordill = regEx[3]

    @p = Product.find_by_model(@model)
---
SELECT * FROM `products` WHERE (`products`.`model` = '004') LIMIT 1

  def add
    #lectura de parametres
    pr_id    = params[:id]
    pr_color = params[:color]
    pr_talla = params[:talla]
    pr_cord  = params[:cordill]

    #id per una hash format per la concatenacio de tots ells
    @id       = "#{pr_id}#{pr_color}#{pr_cord}#{pr_talla}"

    #carrito=entrada al hash de sessio
    #s_id     = session[:session_id]
    #@carrito  = session[s_id]

    session[:cart]||={}

    @cart=session[:cart]

    #si existeix..
    if (@cart[@id])
      #..afegim una unitat
      @cart[@id][:unitats] = @cart[@id][:unitats].to_i + 1
    else
      #buscamos el producto para el precio i la descripcion
      p=Product.find_by_model(pr_id)
---
SELECT * FROM `products` WHERE (`products`.`model` IS NULL) LIMIT 1

  def get_promocode
    promo = Promocode.find_by_code(params[:id])
---
SELECT * FROM `promocodes` WHERE (`promocodes`.`code` = 'HSGLKFVH') LIMIT 1

  def buyIt
    buyer = Buyers.new()

    buyer.nombre = params[:nombre]
    buyer.email  = params[:email]
    buyer.idioma   = params[:idioma]
    buyer.conocio= params[:conocio]
    buyer.save()
---
INSERT INTO `buyers` (`created_at`, `nombre`, `idioma`, `updated_at`, `email`, `conocio`) VALUES('2010-09-15 21:41:54', 'p', 'pp', '2010-09-15 21:41:54', 'pp', ' A través de un amigo')

  def payPal
    @cart=session[:cart]
    @total,@envio = get_total_envio
    @total = @total
    if session[:promocode] then
      #invalidamos el promocode
      p=Promocode.find_by_code(session[:promocode])
      p.state = false
      p.save()
---
SELECT * FROM `promocodes` WHERE (`promocodes`.`code` = 'HSGLKFVH') LIMIT 1
UPDATE `promocodes` SET `updated_at` = '2011-02-27 23:01:58', `state` = 0 WHERE `id` = 7

  def list
    @banner = Configuration.find_by_key('banner').value
---
SELECT * FROM `configurations` WHERE (`configurations`.`key` = 'banner') LIMIT 1

  def list2
    @banner = Configuration.find_by_key('banner').value
---
SELECT * FROM `configurations` WHERE (`configurations`.`key` = 'banner') LIMIT 1